#pragma once


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
namespace Memory
{
    namespace RAM
    {
        /// Установить текущим следующий сигнал
        void SelectNextSignal();
        /// Установить текущим предыдущий сигнал
        void SelectPrevSignal();
        /// Текущий номер сигнала в режиме ПОСЛЕДНИЕ
        int16 CurrentSignal();
    }
}
