#include "defines.h"
#include <stm32f4xx.h>
#include <stm32f4xx_hal.h>
#include "log.h"
#include "Timer.h"
#include "stm32/Timer4XX.h"
#include <climits>


using namespace Hardware;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#if defined(STM32F437xx) || defined(STM32F407xx) || defined(STM32F429xx)

static Timer4XX tim2;   // Для тиков
static Timer4XX tim3;   // Для таймеров

#elif defined STM32F207xx

static Timer2XX tim2;   // Для тиков
static Timer2XX tim3;   // Для таймеров

#endif


typedef struct
{
    pFuncVV func;       // Функция таймера
    uint    dTms;          // Период срабатывания, мс
    uint    timeNextMS;    // Время следующего срабатывания. Если == 0xffffffff, то таймер неактивен
    bool    repeat;        // Если true, будет срабатывать, пока не будет вызвана функция Timer_Disable()
    uint8   notUsed0;
    uint8   notUsed1;
    uint8   notUsed2;
} TimerStruct;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static TimerStruct timers[Timer::Type::Number];
static uint timeStartLogging = 0;
static uint timePrevPoint = 0;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#undef TIME_NEXT
#define TIME_NEXT(type) (timers[type].timeNextMS)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// Завести таймр, который остановится в timeStop мс
static void StartTIM(uint timeStop);

static void StopTIM();
/// Возвращает время срабатывания ближайщего таймера, либо 0, если таймеров нет
static uint NearestTime();
/// Настроить систему на таймер
static void TuneTIM(Timer::Type::E type);


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
bool Timer::IsRun(Timer::Type::E type)
{
    return TIME_NEXT(type) != UINT_MAX; //-V2523
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::Init()
{
    for(uint i = 0; i < Timer::Type::Number; i++)
    {
        timers[i].timeNextMS = UINT_MAX; //-V2523
    }
   
    tim3.Init(TIM3, 54000 - 1, TIM_COUNTERMODE_UP, 1, TIM_CLOCKDIVISION_DIV1);
    tim3.EnabledIRQ(1, 1);

    tim2.Init(TIM2, 0, TIM_COUNTERMODE_UP, (uint)-1, TIM_CLOCKDIVISION_DIV1);
    tim2.Start();
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::DeInit()
{
    tim2.Stop();
    tim2.DeInit();
    
    tim3.DisableIRQ();
    tim3.StopIT();
    tim3.DeInit();
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::ElapsedCallback()
{
    uint time = TIME_MS;

    if (NearestTime() > time)
    {
        return;
    }

    StopTIM();

    for (uint type = 0; type < Timer::Type::Number; type++)
    {
        if (TIME_NEXT(type) <= time)            // Если пришло время срабатывания
        {
            TimerStruct *timer = &timers[type];
            if(timer->func)
            {
                timer->func();
            }
            if (timer->repeat)
            {
                do      // Цикл нужен потому, что системный таймер SysTick, который отсчитываем миллисекунды, имеет наивысший приоритет,
                {       // и если функция выполняется дольше, чем timer->dTm мс, то оно тут зависнет
                    timer->timeNextMS += timer->dTms;
                } while (timer->timeNextMS < TIME_MS);

            }
            else
            {
                timer->timeNextMS = UINT_MAX; //-V2523
            }
        }
    }

    StartTIM(NearestTime());
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::Set(Timer::Type::E type, pFuncVV func, uint dTms)
{
    TimerStruct *timer = &timers[type];
    timer->func = func;
    timer->dTms = dTms;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::SetAndStartOnce(Timer::Type::E type, pFuncVV func, uint dTms)
{
    Timer::Set(type, func, dTms);
    StartOnce(type);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::SetAndEnable(Timer::Type::E type, pFuncVV func, uint dTms)
{
    Set(type, func, dTms);
    Enable(type);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::StartOnce(Timer::Type::E type)
{
    timers[type].repeat = false;
    TuneTIM(type);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::Enable(Timer::Type::E type)
{
    timers[type].repeat = true;
    TuneTIM(type);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void TuneTIM(Timer::Type::E type)
{
    TimerStruct *timer = &timers[type];

    uint timeNearest = NearestTime();

    uint timeNext = TIME_MS + timer->dTms;
    timer->timeNextMS = timeNext;

    if(timeNext < timeNearest)      // Если таймер должен сработать раньше текущего
    {
        StartTIM(timeNext);         // то заводим таймер на наше время
    }
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::Disable(Timer::Type::E type)
{
    timers[type].timeNextMS = UINT_MAX; //-V2523
    timers[type].repeat = false;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static uint NearestTime()
{
    uint time = UINT_MAX; //-V2523

    for(uint type = 0; type < Timer::Type::Number; type++)
    {
        if(TIME_NEXT(type) < time)
        {
            time = TIME_NEXT(type);
        }
    }
    
    return time;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void StartTIM(uint timeStopMS)
{
    StopTIM();

    if(timeStopMS == UINT_MAX) //-V2523
    {
        return;
    }

    uint dT = timeStopMS - TIME_MS;

    tim3.StartIT((dT * 2) - 1);             // 10 соответствует 0.1мс. Т.е. если нам нужна 1мс, нужно засылать (100 - 1)
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void StopTIM()
{
    tim3.StopIT();
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::PauseOnTime(uint timeMS)
{
    HAL_Delay(timeMS);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::PauseOnTicks(uint numTicks)
{
    volatile uint startTicks = TIME_TICKS;

    while (TIME_TICKS - startTicks < numTicks)    {};
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Timer::StartLogging()
{
    timeStartLogging = TIME_TICKS;
    timePrevPoint = timeStartLogging;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
uint Timer::LogPointUS(char * name)
{
    uint interval = TIME_TICKS - timePrevPoint;
    timePrevPoint = TIME_TICKS;
    LOG_WRITE("%s %.2f us", name, interval / 120.0);
    return interval;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
uint Timer::LogPointMS(char * name)
{
    uint interval = TIME_TICKS - timePrevPoint;
    timePrevPoint = TIME_TICKS;
    LOG_WRITE("%s %.2f ms", name, interval / 120e3);
    return interval;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
uint Timer::TimeUS()
{
    return TIM2->CNT / 90;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
uint Timer::TimeTicks()
{
    return TIM2->CNT;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
uint Timer::TimeMS()
{
    return HAL_GetTick();
}
