
/*! \page page1 Межпроцессорные коммуникации

    \tableofcontents

    \section section1 Межплатный шлейф

    \code
    +----+-------+--------------+----+------------+-------------+----+
    | №  | Наим. |    437ZIT         |            |   429VIT6        |
    |конт|       |     FPGA          |            |   Панель         |
    +----+-------+--------------+----+------------+-------------+----+
    |    |       | 43  PA7      | I  | READ_READY | 8  PC14     | O  | Низкий уровень означает, что панель готова к чтению данных
    |    |       | 44  PC4      | I  | SEND_READY | 9  PC15     | O  | Низкий уровень означает, что панель готова к передаче данных
    |    |       | 127 PG12 CS  | O  | CS         | 7  PC13     | I  | Низкий уровень означает начало транзакции со стороны ЦП
    |    |       |              |    |            |             |    |
    |    | AD0   | 85  PD14 D0  | IO | D0         | 97 PE0  DA0 | IO |
    |    | AD1   | 86  PD15 D1  | IO | D1         | 98 PE1  DA1 | IO |
    |    | AD2   | 114 PD0  D2  | IO | D2         | 1  PE2  DA2 | IO |
    |    | AD3   | 115 PD1  D3  | IO | D3         | 2  PE3  DA3 | IO |
    |    | AD4   | 58  PE7  D4  | O  | TYPE       | 3  PE4      | I  | Тип транзакции - "0 - чтение из панели"/"1 - запись в панель"
    |    | AD5   | 59  PE8  D5  | I  | CONF_PANEL | 4  PE5      | O  | "1" -> "0" Подтверждение панелью завершения транзакции. ЦП даёт обратное подтверждением переводом CS в высокое состояние
    |    | AD6   | 60  PE9  D6  | O  | NIBBLE     | 5  PE6      | I  | 0 - младший полубайт, 1 - старший полубайт
    |    | AD7   | 63  PE10 D7  | O  | CONF_CPU   | 38 PE7      | I  | "1" -> "0" Подтверждение МПУ о том, что подтверждение панели получено
    +----+-------+--------------+----+------------+-------------+----+
    
    +----+----+------------------------------------------------------+----------------------------------------------------------------------+
    | M0 | M1 | Алгоритм работы устройства                           | Алгоритм работы панели                                               |
    +----+----+------------------------------------------------------+----------------------------------------------------------------------+
    |    |    | 1. Если есть сигнал "READ_READY":                    |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    |    |    |                                                      |                                                                      |
    +----+----+------------------------------------------------------+----------------------------------------------------------------------+

    \endcode
       

    \section section2 Работа с тестер-компонентом

    \code
    +----+----------+------+-----+--------------------------------------------------------+
    | №  |          |      |     |                                                        |
    |конт|          |      |     |                                                        |
    +----+----------+------+-----+--------------------------------------------------------+
    | 41 | DAC_TEST | PA5  | ЦАП | Сюда подаём напряжение в соотвествии с выбранным шагом |
    | 53 | TEST_ON  | PF13 | OUT | Включение тестер-компонента. Активный уровень - 0      |
    | 54 | PNP      | PF14 | OUT | Отрицательная полярность - 1, положительная - 0        |
    | 55 | U        | PF15 | OUT | 1 - управление напряжением, 0 - управление током       |
    | 56 | I        | PG0  | OUT | 1 - управление током, 0 - управление напряжением       |
    | 99 | TEST_STR | PC9  | IN  | Тактовые имульсы                                       |
    +----+----------+------+-----+--------------------------------------------------------+
    \endcode
    
    Примечания.
    *ШД - шина данных.
*/
