///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*! \page page6 Структура меню

    \tableofcontents

    \section section01 ДИСПЛЕЙ

    \code

    |   ДИСПЛЕЙ   |
    +------+------+
           |
           +------| Отображение |.............| Вектор | Точки |
           |                    
           +------|   НАКОПЛ    |
           |      +------+------+
           |             |
           |             +------| Количество  |.............| Откл          | 2          | 4 | 8 | 16 | 32 | 64 | 128 | Бесконечность |
           |             |                    
           |             +------| Режим       |.............| Не сбрасывать | Сбрасывать |
           |             |
           |             +------| Очистить    |
           |
           |
           +------|   УСРЕДН    |
           |      +------+------+
           |             |
           |             +------| Количество  |.............| Откл  | 2              | 4       | 8       | 16      | 32      | 64      | 128     | 256     | 512      |
           |             |
           |             +------| Режим       |.............| Точно | Приблизительно |
           |             
           +------| Мин Макс    |.............| Откл  | 2       | 4       | 8       | 16      | 32      | 64      | 128     |
           |                                          
           +------| Сглаж       |.............| Откл  | 2 точки | 3 точки | 4 точки | 5 точек | 6 точек | 7 точек | 8 точек | 9 точек | 10 точек |
           |                                          
           +------| Частота обн |.............| 25    | 10      | 5       | 2       | 1       |
           |             
           +------|    СЕТКА    |
           |      +------+------+
           |             |
           |             +------| Тип         |.............| Тип 1 | Тип 2 | Тип 3 | Тип 4 |
           |             |
           |             +------| Яркость     |.............[0...100]
           |              
           +------| Смещение    |.............| Напряжение | Деления |
           |
           +--------------------|  НАСТРОЙКИ
           |                    +------+------+
           |                           |
           |                           +------|    ЦВЕТА    |
           |                           |      +------+------+
           |                           |             |
           |                           |             +------| Cбросить
           |                           |             |
           |                           |             +------| Цветовая сх |.............| Схема 1 | Cхема 2 |
           |                           |             |
           |                           |             +------| Канал 1
           |                           |             |
           |                           |             +------| Канал 2
           |                           |             |
           |                           |             +------| Сетка
           |                           |             |
           |                           |             +------| Фон         |.............| Чёрный  | Белый   |
           |                           |
           |                           +------| Яркость     |.............[0...100]
           |                           |
           |                           +------| Уровни
           |                           |
           |                           +------| Время
           |                           |
           |                           +------| Строка меню |.............| Временно | Всегда | Никогда |

    \endcode

    \section section02 КАНАЛ 1

    \section section03 КАНАЛ 2

    \section section04 СИНХР

    \section section05 РАЗВ

    \section section06 ФУНКЦИЯ

    \code

    |   ФУНКЦИЯ   |
    +------+------+
           |
           +------| МУЛЬТИМЕТР  |
           |      +------+------+
           |             |
           |             +------| Режим       |.............| U=    | U~     | I=      | I~     | R | VD | BELL |
           |             |                    
           |             +------| Предел      |.............| 2 В   | 50 В   | 500 В   |          *** Режим - U=   ***
           |             |                                  | 2 В   | 40 В   | 400 В   |          *** Режим - U~   ***
           |             |                                  | 2 кОм | 20 кОм | 200 кОм | 10 МОм | *** Режим - R    ***
           |             |                                  --- запрещено ---                     *** Режим - VD   ***
           |             |                                  --- запрещено ---                     *** Режим - BELL ***
           |             |
           |             +------| АВП         |.............| Откл  | Вкл    |
           |
           |
           +------| ЧАСТОТОМЕР  |
           |      +------+------+
           |             |
           |             +------| Отображение |.............| Откл    | Вкл   |
           |             |
           |             +------| Время счёта |.............| 100 мс  | 1 c   | 10  c  |
           |             |
           |             +------|Метки времени|.............| 100 кГц | 1 МГц | 10 МГц | 100 МГц |
           |             |
           |             +------| Кол периодов|.............| 1       | 10    | 100    |
           |
           |
           +------| РЕГИСТРАТОР |
           |      +------+------+
           |             |
           |             +------| Всегда      |.............| Откл | Вкл |
           |             |
           |             |
           |             +------| ИСТОЧНИК    |
           |             |      +------+------+
           |             |             |
           |             |             +------| Канал 1     |.............| Откл | Вкл |
           |             |             |
           |             |             +------| Канал 2     |.............| Откл | Вкл |
           |             |             |
           |             |             +------| Датчик      |.............| Откл | Вкл |
           |             |             
           |             |
           |             +------|   ЗАПИСЬ    |
           |             |      +------+------+
           |             |             |
           |             |             +------| Сохранять в |.............| USB-PC | USB-Flash |
           |             |
           |             |
           |             +------|  ПРОСМОТР   |
           |                    +------+------+
           |                           |
           |                           +------| Источник    |.............| USB-PC | USB-Flash |
           |
           |
           +------|   СПЕКТР    |
           |      +------+------+
           |             |
           |             +------| Отображение |.............| Откл        | Вкл      |
           |             |
           |             +------| Шкала       |.............| Логарифм    | Линейная |
           |             |
           |             +------| Источник    |.............| Канал 1 + 2 | Канал 1  | Канал 2 |
           |             |
           |             +------| Окно        |.............| Хэмминга    | Блэкмена | Ханна   | Прямоугольн |
           |             |
           |             +------|   КУРСОРЫ   |
           |                    +------+------+
           |      
           |      
           |
           |      
           +------|  TЕСТЕР-К   |
                  +------+------+
                         |
                         +------| Управление  |.............| Напряжение | Ток    |
                         |
                         +------| Шаг         |.............| 100 мВ     | 500 мВ | *** Управление - Напряжение ***
                         |                                  | 4 мА       | 20 ма  | *** Управление - Ток        ***
                         |
                         +------| Полярность  |.............| +          | -      |
                         |
                         +------| Отображение |.............| Линии      | Точки  |
                         |
                         +------| Сглаживание |.............| 1          | 2      | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |

    \endcode

    \section section07 ИЗМЕР

    \code

    |   ФУНКЦИЯ   |
    +------+------+
           |
           |
           +------|   КУРСОРЫ   |
           |      +------+------+
           |             |
           |             +------| Показывать  |.............| Нет  | Да |
           |             |
           |             +------| Отслеж 1 к  |.............| Откл | Напряжение | Время | Напряжение и время |
           |             |
           |             +------| Отслеж 2 к  |.............| Откл | Напряжение | Время | Напряжение и время |
           |             |
           |             +------| 1/dT        |.............| Откл | Вкл |
           |             |
           |             +------|  УСТАНОВИТЬ |
           |                    +------+------+
           |                           |
           |                           +------|             |
           |
           +------|   АВТОМАТ   |
                  +------+------+
                         |
                         +------| Показывать  |.............| Нет | Да |
                         |
                         +------| Количество  |.............| 1   | 2  | 1x5   | 2x5 | 3x5 | 6x1 | 6x2 |
                         |
                         +------| Каналы      |.............| 1   | 2  | 1 и 2 |
                         |
                         +------|  НАСТРОИТЬ  |
                                +------+------+
                                       |
                                       +------|             |


    \code

    \section section08 ПАМЯТЬ

    \section section09 СЕРВИС

*/
