#pragma once


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
namespace Osci
{
    void Init();

    void Update();

    void DeInit();

    void Start();

    void Stop(bool pause = false);
    /// ¬озвращает true, если находитс€ в поточечном режиме
    bool InModeP2P();
    /// ¬озвращает true, если работает в режиме рандомизатора
    bool InModeRandomizer();
};
