#pragma once


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
namespace Osci
{
    void Init();

    void Update();

    void DeInit();

    void Start();

    void Stop(bool pause = false);
    /// Это вызываем в случае изменения настройки
    void Restart();
    /// Возвращает true, если находится в поточечном режиме
    bool InModeP2P();
    /// Возвращает true, если работает в режиме рандомизатора
    bool InModeRandomizer();
    /// Эту функцию надо вызывать при изменении длины памяти. Ну или режима пикового детектора
    void OnChangedPoints();

    extern int addShift;

    extern const int Kr[];
};
