#include "defines.h"
#include "FPGA/FPGA.h"
#include "FPGA/FPGA_Settings.h"
#include "Menu/MenuItems.h"
#include "Menu/Pages/Include/PageService.h"
#include "Settings/Settings.h"
#include "Settings/SettingsNRST.h"


using namespace Osci::Settings;

extern const PageBase pageRand;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const PageBase *PageService::PageDebug::PageRand::pointer = &pageRand;


//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_GOVERNOR( gRand_NumAverage,                                                                                                                        //--- ОТЛАДКА - РАНД-ТОР - Усредн. ---
    "Усредн.",
    "",
    NRST_NUM_AVE_FOR_RAND, 1, 32, pageRand, FuncActive, FuncChanged, FuncBeforeDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_GOVERNOR( gRand_NumSmooth,                                                                                                                     //--- ОТЛАДКА - РАНД-ТОР - Сглаживание ---
    "Сглаживание",
    "",
    NRST_NUM_SMOOTH_FOR_RAND, 1, 10, pageRand, FuncActive, FuncChanged, FuncBeforeDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnChanged_Rand_NumMeasures()
{
}

DEF_GOVERNOR( gRand_NumMeasures,                                                                                                                  //--- ОТЛАДКА - РАНД-ТОР - Выб-к/ворота ---
    "Выб-к/ворота",
    "",
    NUM_MEASURES_FOR_GATES, 1, 2500, pageRand, FuncActive, OnChanged_Rand_NumMeasures, FuncBeforeDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRand_ShowInfo,                                                                                                                       //--- ОТЛАДКА - РАНД-ТОР - Информация ---
    "Информация",
    "Показывать информацию о воротах рандомизатора"
    ,
    "Не показывать",
    "Показывать",
    SHOW_RAND_INFO, pageRand, Choice::FuncActive, Choice::FuncChange, Choice::FuncDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( gRand_ShowStat,                                                                                                                       //--- ОТЛАДКА - РАНД-ТОР - Статистика ---
    "Статистика",
    "Показывать график статистики"
    ,
    "Не показывать",
    "Показывать",
    SHOW_RAND_STAT, pageRand, Choice::FuncActive, Choice::FuncChange, Choice::FuncDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnChanged_Rand_TimeCompensation()
{
}

DEF_GOVERNOR( gRand_TimeCompensation,                                                                                                     //--- ОТЛАДКА - РАНД-ТОР - Компенсация задержки ---
    "Компенсация задержки",
    "Подстройка компенсации задержки АЦП 40 нс",
    TIME_COMPENSATION, 0, 510, pageRand, FuncActive, OnChanged_Rand_TimeCompensation, FuncBeforeDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnChanged_Rand_AddTimeShift()
{
    TShift::Set(SET_TSHIFT);
}

static int16 addShift = 0;

DEF_GOVERNOR( gRand_AddTimeShift,                                                                                                                     //--- ОТЛАДКА - РАНД-ТОР - Смещение ---
    "Доп смещение",
    "Добавочное смщение при вращении tShift",
    addShift, -100, 100, pageRand, FuncActive, OnChanged_Rand_AddTimeShift, FuncBeforeDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnChanged_Rand_Pretriggered()
{
    TShift::Load();
}

DEF_GOVERNOR( gRand_Pretriggered,                                                                                                                   //--- ОТЛАДКА - РАНД-ТОР - Предзапуск ---
    "Предзапуск",
    "Величина предзапуска, которая пишется в рандомизатор",
    PRETRIGGERED, 0, 30000, pageRand, FuncActive, OnChanged_Rand_Pretriggered, FuncBeforeDraw
)


//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_16( gGateMax,                                                                                                                           //--- ОТЛАДКА - РАНД-ТОР - Ворота верх ---
    "Ворота верх",
    "Устанавливает учитываемое расстояние от максимума ворот для рандомизатора",
    "0",
    "10",
    "20",
    "30",
    "40",
    "50",
    "60",
    "70",
    "80",
    "90",
    "100",
    "110",
    "120",
    "130",
    "140",
    "150",
    set.dbg_enum_gate_max, pageRand, Choice::FuncActive, Choice::FuncChange, Choice::FuncDraw
)


//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_16( gGateMin,                                                                                                                            //--- ОТЛАДКА - РАНД-ТОР - Ворота низ ---
    "Ворота низ",
    "Устанавливает учитываемое расстояние от минимума ворот для рандомизатора",
    "0",
    "10",
    "20",
    "30",
    "40",
    "50",
    "60",
    "70",
    "80",
    "90",
    "100",
    "110",
    "120",
    "130",
    "140",
    "150",
    set.dbg_enum_gate_min, pageRand, Choice::FuncActive, Choice::FuncChange, Choice::FuncDraw
)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_PAGE_2( pageRand, // -V641 // -V1027                                                                                                                         //--- ОТЛАДКА - РАНД-ТОР ---
    "РАНД-ТОР",
    "",
    &gGateMin,                      ///< ОТЛАДКА - РАНД-ТОР - Ворота низ
    &gGateMax,                      ///< ОТЛАДКА - РАНД-ТОР - Ворота верх

    //&gRand_NumAverage,          ///< ОТЛАДКА - РАНД-ТОР - Усредн.
    //&gRand_NumSmooth,           ///< ОТЛАДКА - РАНД-ТОР - Сглаживание
    //&gRand_NumMeasures,         ///< ОТЛАДКА - РАНД-ТОР - Выб-к/ворота
    //&cRand_ShowInfo,            ///< ОТЛАДКА - РАНД-ТОР - Информация
    //&gRand_ShowStat,            ///< ОТЛАДКА - РАНД-ТОР - Статистика
    //&gRand_TimeCompensation,    ///< ОТЛАДКА - РАНД-ТОР - Компенсация задержки
    //&gRand_AddTimeShift,        ///< ОТЛАДКА - РАНД-ТОР - Смещение
    //&gRand_Pretriggered,        ///< ОТЛАДКА - РAНД-ТОР - Предзапуск
    Page::Name::Debug_Rand, PageService::PageDebug::pointer, Page::FuncActive, Page::FuncPress, Page::FuncDraw, Page::FuncRegSet
)
