#include "defines.h"
#include "Display/Colors.h"
#include "Display/Console.h"
#include "Display/Painter.h"
#include "Menu/MenuItems.h"
#include "Menu/Pages/Include/PageService.h"
#include "Settings/Settings.h"


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
extern const PageBase pageConsole;
extern const PageBase pageRegisters;

const Page * const PageDebug::PageConsole::self = (const Page *)&pageConsole;
const Page * const PageDebug::PageRegisters::self = (const Page *)&pageRegisters;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_CHOICE_2( cShow,                                                                                                                                 //--- ОТЛАДКА - КОНСОЛЬ - Показывать ---
    "Показывать",
    "",
    "Нет",
    "Да",
    set.dbg_showConsole, &PageDebug::PageConsole::self, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_GOVERNOR( gNumStrings,                                                                                                                          //--- ОТЛАДКА - КОНСОЛЬ - Число строк ---
    "Число строк",
    "",
    CONSOLE_NUM_STRINGS, 0, 33, &PageDebug::PageConsole::self, 0, Console::OnChangedMaxStringsInConsole, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//DEF_CHOICE_2( cSizeFont,                                                                                                                          //--- ОТЛАДКА - КОНСОЛЬ - Размер шрифта ---
//    "Размер шрифта",
//    "",
//    "5",
//    "8",
//    set.dbg_sizeFont, &PageDebug::PageConsole::self, 0, 0, 0
//)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//DEF_CHOICE_2( cModeStop,                                                                                                                          //--- ОТЛАДКА - КОНСОЛЬ - Реж. останова ---
//    "Реж. останова",
//    "Предоставляет возможность приостановки вывода в консоль путём нажатия на кнопку ПУСК/СТОП",
//    DISABLE_RU,
//    ENABLE_RU,
//    MODE_PAUSE_CONSOLE, &PageDebug::PageConsole::self, 0, 0, 0
//)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_ShowAll,                                                                                                     //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - Показывать все ---
    "Показывать все",
    "Показывать все значения, засылаемые в регистры",
    "Нет",
    "Да",
    DBG_SHOW_ALL, &PageDebug::PageRegisters::self, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static bool IsActive_Console_Registers()
{
    return DBG_SHOW_ALL;
}

DEF_CHOICE_2( cRegisters_RD_FL,                                                                                                                //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - RD_FL ---
    "RD_FL",
    "",
    DISABLE_RU,
    ENABLE_RU,
    DBG_SHOW_FLAG, &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_RShiftA,                                                                                                           //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - U см. 1к ---
    "U см. 1к",
    "",
    DISABLE_RU,
    ENABLE_RU,
    set.dbg_showRShift[Chan::A], &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_RShiftB,                                                                                                           //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - U см. 2к ---
    "U см. 2к",
    "",
    DISABLE_RU,
    ENABLE_RU,
    set.dbg_showRShift[Chan::B], &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_TrigLev,                                                                                                           //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - U синхр. ---
    "U синхр.",
    "",
    DISABLE_RU,
    ENABLE_RU,
    set.dbg_showTrigLev, &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_RangeA,                                                                                                         //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - ВОЛЬТ/ДЕЛ 1 ---
    "ВОЛЬТ/ДЕЛ 1",
    "",
    DISABLE_RU,
    ENABLE_RU,
    set.dbg_showRange[Chan::A], &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_RangeB,                                                                                                         //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - ВОЛЬТ/ДЕЛ 2 ---
    "ВОЛЬТ/ДЕЛ 2",
    "",
    DISABLE_RU,
    ENABLE_RU,
    set.dbg_showRange[Chan::B], &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_TrigParam,                                                                                                    //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - Парам. синхр. ---
    "Парам. синхр.",
    "",
    DISABLE_RU,
    ENABLE_RU,
    set.dbg_showTrigParam, &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_ChanParamA,                                                                                                   //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - Парам. кан. 2 ---
    "Парам. кан. 1",
    "",
    DISABLE_RU,
    ENABLE_RU,
    set.dbg_showChanParam[Chan::A], &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_ChanParamB,                                                                                                   //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - Парам. кан. 2 ---
    "Парам. кан. 2",
    "",
    DISABLE_RU,
    ENABLE_RU,
    set.dbg_showChanParam[Chan::B], &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_TBase,                                                                                                            //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - ВРЕМЯ/ДЕЛ ---
    "ВРЕМЯ/ДЕЛ",
    "",
    DISABLE_RU,
    ENABLE_RU,
    set.dbg_showTBase, &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cRegisters_TShift,                                                                                                               //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - Т см. ---
    "Т см.",
    "",
    DISABLE_RU,
    ENABLE_RU,
    set.dbg_showTShift, &PageDebug::PageRegisters::self, IsActive_Console_Registers, 0, 0
)

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_PAGE_12( pageRegisters, // -V641                                                                                                                   //--- ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ ---
    "РЕГИСТРЫ",
    "",
    &cRegisters_ShowAll,        ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - Показывать все
    &cRegisters_RD_FL,          ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - RD_FL
    &cRegisters_RShiftA,        ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - U см. 1к
    &cRegisters_RShiftB,        ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - U см. 2к
    &cRegisters_TrigLev,        ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - U синхр
    &cRegisters_RangeA,         ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - ВОЛЬТ/ДЕЛ 1
    &cRegisters_RangeB,         ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - ВОЛЬТ/ДЕЛ 2
    &cRegisters_TrigParam,      ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - Парам. синхр.
    &cRegisters_ChanParamA,     ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - Парам. кан. 1
    &cRegisters_ChanParamB,     ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - Парам. кан. 2
    &cRegisters_TBase,          ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - ВРЕМЯ/ДЕЛ
    &cRegisters_TShift,         ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ - Т см.
    Page::Name::Debug_Console_Registers, &PageDebug::PageConsole::self, 0, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//static void Draw_Console_SizeSettings(int x, int y)
//{
//    String("Разм.настр. %d", sizeof(Settings)).Draw(x + 6, y + 13, Color::BACK);
//}
//
//DEF_BUTTON( bSizeSettings,                                                                                                                      //--- ОТЛАДКА - КОНСОЛЬ - Размер настроек ---
//    "",
//    "Показывает текущий размер структуры для сохранения настроек",
//    &PageDebug::PageConsole::self, 0, 0, Draw_Console_SizeSettings
//)

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_PAGE_2( pageConsole, // -V641 // -V1027                                                                                                                       //--- ОТЛАДКА - КОНСОЛЬ ---
    "КОНСОЛЬ",
    "Управляет отображением и параметрами отладочной консоли",
    &cShow,             ///< ОТЛАДКА - КОНСОЛЬ - Показывать
    &gNumStrings,       ///< ОТЛАДКА - КОНСОЛЬ - Число строк
//    &cSizeFont,         ///< ОТЛАДКА - КОНСОЛЬ - Размер шрифта
//    &cModeStop,         ///< ОТЛАДКА - КОНСОЛЬ - Реж. останова
//    &pageRegisters,     ///< ОТЛАДКА - КОНСОЛЬ - РЕГИСТРЫ
//    &bSizeSettings,     ///< ОТЛАДКА - КОНСОЛЬ - Размер настроек
    Page::Name::Debug_Console, &PageDebug::self, 0, 0, 0, 0
)

