#include "defines.h"
#include "Dictionary.h"


pString dictWords[DNumWords] =
{
    "Гц",
    "кГц",
    "МГц",
    "с",
    "нс",
    "мкс",
    "мс",
    "Балансировка канала 1",
    "Балансировка канала 2",
    "Калибровка канала 1",
    "Калибровка канала 2",
    "Ур синхр = ",
    "СИ",
    "Обнаружено запоминающее устройство",
    "режим",
    "1к",
    "2к",
    "Сохраняю прошивку",
    "Записываю в память",
    "Удаляю сохранённые данные",
    "Выx",
    "См",
    "Модель",
    "Программное обеспечение :",
    "версия %s",
    "ИНФОРМАЦИЯ",
    "Файл сохранён"
};
