#include "stdafx.h"
#ifndef WIN32
#include "defines.h"
#include "String.h"
#include <cstring>
#include <cstdio>
#include <cstdlib>
#include <stdarg.h>
#endif


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
String::String() : buffer(0)
{

}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
String::String(const String &rhs) : buffer(0)
{
    if (Allocate(std::strlen(rhs.CString())) + 1)
    {
        std::strcpy(buffer, rhs.CString());
    }
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
String::String(char *format, ...)
{
#define SIZE 100
    char buf[SIZE + 1];

    va_list args;
    va_start(args, format);
    int numSymbols = std::vsprintf(buf, format, args);
    va_end(args);

    if (numSymbols < 0 || numSymbols > SIZE)
    {
        LOG_ERROR("Буфер слишком мал");
    }

    if (Allocate(std::strlen(buf) + 1))
    {
        std::strcpy(buffer, buf);
    }
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
String::~String()
{
    std::free(buffer);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
char *String::CString() const
{
    return buffer;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
bool String::Allocate(uint size)
{
    buffer = (char *)std::malloc(size);
    if (buffer)
    {
        return true;
    }
    else
    {
        LOG_ERROR("Не хватает памяти");
    }
    return false;
}
