#include "defines.h"
#include "Display/Painter.h"
#include "Menu/Pages/Include/PageDisplay.h"
#include "FPGA/FPGA.h"
#include "Menu/Menu.h"
#include "Utils/CommonFunctions.h"
#include "Settings/Settings.h"

#include "Osci/Osci.h"
#include "Osci/Osci_Averager.h"


using namespace Osci::Settings;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
extern const PageBase pageDisplay;

const PageBase *PageDisplay::pointer = &pageDisplay;


//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/*
DEF_CHOICE_2( cThickness,                                                                                                                                         //--- ДИСПЛЕЙ - Толщина ---
    "Толщина", "Thickness",
    "Позволяет изменять толщину выводимых на экран изображений",
    "Allows you to change the thickness of the signals displayed on the screen",
    "x1", "x1",
    "x3", "x3",
    THICKNESS_SIGNAL, pageDisplay, 0, 0, Choice::FuncDraw
)
*/

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void PageDisplay::Init()
{
    PageSettings::PageColors::Init();   // Заносим значения в гувернёры цветов
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cViewMode,                                                                                                                                      //--- ДИСПЛЕЙ - Отображение ---
    "Отображ.",
    "Задаёт режим отображения сигнала.",
    "Вектор",
    "Точки",
    MODE_DRAW_SIGNAL, pageDisplay, 0, 0, Choice::FuncDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static bool IsActive_MinMax()
{
    return !Osci::InModeRandomizer() && !Osci::InModeP2P();
}

static void OnChanged_MinMax(bool)
{
}

DEF_CHOICE_8( cMinMax,                                                                                                                                           //--- ДИСПЛЕЙ - Мин Макс ---
    "Мин Макс",
    "Задаёт количество последних измерений, по которым строятся ограничительные линии, огибающие минимумы и максимумы измерений.",
    DISABLE_RU,
    "2",
    "4",
    "8",
    "16",
    "32",
    "64",
    "128",
    ENUM_MIN_MAX, pageDisplay, IsActive_MinMax, OnChanged_MinMax, Choice::FuncDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_10( cSmoothing,                                                                                                                                    //--- ДИСПЛЕЙ - Сглаживание ---
    "Сглаж.",
    "Устанавливает количество точек для расчёта сглаженного по соседним точкам сигнала.",
    DISABLE_RU,
    "2 точки",
    "3 точки",
    "4 точки",
    "5 точек",
    "6 точек",
    "7 точек",
    "8 точек",
    "9 точек",
    "10 точек",
    ENUM_SMOOTHING.value, pageDisplay, 0, 0, Choice::FuncDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_5( cRefreshFPS,                                                                                                                                 //--- ДИСПЛЕЙ - Частота обновл ---
    "Частота обновл",
    "Задаёт максимальное число выводимых в секунду кадров.",
    "25",
    "10",
    "5",
    "2",
    "1",
    ENUM_SIGNALS_IN_SEC.value, pageDisplay, 0, 0, Choice::FuncDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cScaleYtype,                                                                                                                                       //--- ДИСПЛЕЙ - Смещение ---
    "Смещение",
    "Задаёт режим удержания смещения по вертикали\n1. \"Напряжение\" - сохраняется наряжение смещения.\n2. \"Деления\" - сохраняется положение "
    "смещения на экране.",
    "Напряжение",
    "Деления",
    LINKING_RSHIFT, pageDisplay, 0, 0, Choice::FuncDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_4( cType, // -V206                                                                                                                                       //--- ДИСПЛЕЙ - Сетка ---
    "Сетка",
    "Выбор типа сетки",
    "Тип 1",
    "Тип 2",
    "Тип 3",
    "Тип 4",
    TYPE_GRID, pageDisplay, 0, 0, Choice::FuncDraw
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnChange_AverageNum(bool)
{
    Osci::Averager::SettingChanged();
}

DEF_CHOICE_9(cAverage_Num,                                                                                                                        //--- ДИСПЛЕЙ - УСРЕДНЕНИЕ - Количество ---
    "Усреднение",
    "Задаёт количество последних измерений, по которым производится усреднение.",
    DISABLE_RU,
    "2",
    "4",
    "8",
    "16",
    "32",
    "64",
    "128",
    "256",
    ENUM_AVE, pageDisplay, 0, OnChange_AverageNum, Choice::FuncDraw
)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_PAGE_9( pageDisplay, // -V641 // -V1027                                                                                                                                 //--- ДИСПЛЕЙ ---
    "ДИСПЛЕЙ",
    "Содержит настройки отображения дисплея.",
    &cViewMode,                             ///< ДИСПЛЕЙ - Отображение
    PageDisplay::PageAccumulation::pointer, ///< ДИСПЛЕЙ - НАКОПЛЕНИЕ
    &cAverage_Num,                          ///< ДИСПЛЕЙ - Усреднение
    //PageDisplay::PageAverage::pointer,      ///< ДИСПЛЕЙ - УСРЕДНЕНИЕ
    &cMinMax,                               ///< ДИСПЛЕЙ - Мин Макс
    &cSmoothing,                            ///< ДИСПЛЕЙ - Сглаживание
    &cRefreshFPS,                           ///< ДИСПЛЕЙ - Частота обновл
    &cType,                                 ///< ДИСПЛЕЙ - Сетка
    //PageDisplay::PageGrid::pointer,         ///< ДИСПЛЕЙ - СЕТКА
    &cScaleYtype,                           ///< ДИСПЛЕЙ - Смещение
    PageDisplay::PageSettings::pointer,     ///< ДИСПЛЕЙ - НАСТРОЙКИ
//    &cThickness,                            ///< ДИСПЛЕЙ - Толщина
    Page::Name::Display, nullptr, 0, Page::FuncPress, Page::FuncDraw, FuncRegSetPage
)
