#include "defines.h"
#include "Display/Painter.h"
#include "Menu/Pages/Include/PageDisplay.h"
#include "FPGA/FPGA.h"
#include "Menu/Menu.h"
#include "Utils/CommonFunctions.h"
#include "Settings/Settings.h"

#include "Osci/Osci.h"
#include "Osci/Osci_Averager.h"


using namespace Osci::Settings;

extern const Page pageDisplay;
extern const Page pageViewSignal;

const Page * const PageDisplay::PageView::self = (const Page *)&pageViewSignal;
const Page * const PageDisplay::self = (const Page *)&pageDisplay;

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_10( cSmoothing,                                                                                                                                    //--- ДИСПЛЕЙ - Сглаживание ---
    "Сглаж.",
    "Устанавливает количество точек для расчёта сглаженного по соседним точкам сигнала.",
    DISABLE_RU,
    "2 точки",
    "3 точки",
    "4 точки",
    "5 точек",
    "6 точек",
    "7 точек",
    "8 точек",
    "9 точек",
    "10 точек",
    ENUM_SMOOTHING.value, &PageDisplay::self, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_5( cRefreshFPS,                                                                                                                                 //--- ДИСПЛЕЙ - Частота обновл ---
    "Частота обновл",
    "Задаёт максимальное число выводимых в секунду кадров.",
    "25",
    "10",
    "5",
    "2",
    "1",
    ENUM_SIGNALS_IN_SEC.value, &PageDisplay::self, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cScaleYtype,                                                                                                                                       //--- ДИСПЛЕЙ - Смещение ---
    "Смещение",
    "Задаёт режим удержания смещения по вертикали\n1. \"Напряжение\" - сохраняется наряжение смещения.\n2. \"Деления\" - сохраняется положение "
    "смещения на экране.",
    "Напряжение",
    "Деления",
    LINKING_RSHIFT, &PageDisplay::self, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_4( cType, // -V206                                                                                                                                       //--- ДИСПЛЕЙ - Сетка ---
    "Сетка",
    "Выбор типа сетки",
    "Тип 1",
    "Тип 2",
    "Тип 3",
    "Тип 4",
    TYPE_GRID, &PageDisplay::self, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnChange_AverageNum(bool)
{
    Osci::Averager::SettingChanged();
}

DEF_CHOICE_9(cAverage_Num,                                                                                                                        //--- ДИСПЛЕЙ - УСРЕДНЕНИЕ - Количество ---
    "Усреднение",
    "Задаёт количество последних измерений, по которым производится усреднение.",
    DISABLE_RU,
    "2",
    "4",
    "8",
    "16",
    "32",
    "64",
    "128",
    "256",
    ENUM_AVE, &PageDisplay::self, 0, OnChange_AverageNum, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cViewMode,                                                                                                                                      //--- ДИСПЛЕЙ - Отображение ---
    "Отображ",
    "Задаёт режим отображения сигнала",
    "Вектор",
    "Точки",
    MODE_DRAW_SIGNAL, &PageDisplay::self, 0, 0, 0
)


DEF_PAGE_1( pageViewSignal, //-V641
    "ОТОБРАЖ",
    "Настройки отображения сигналов",
    &cViewMode,
    Page::Name::Display_View, &PageDisplay::self, 0, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_PAGE_8( pageDisplay, // -V641 // -V1027                                                                                                                                 //--- ДИСПЛЕЙ ---
    "ДИСПЛЕЙ",
    "Содержит настройки отображения дисплея.",
    &cViewMode,                             ///< ДИСПЛЕЙ - Отображение
    PageDisplay::PageAccumulation::self, ///< ДИСПЛЕЙ - НАКОПЛЕНИЕ
    &cAverage_Num,                          ///< ДИСПЛЕЙ - Усреднение
    //PageDisplay::PageAverage::self,      ///< ДИСПЛЕЙ - УСРЕДНЕНИЕ
    &cSmoothing,                            ///< ДИСПЛЕЙ - Сглаживание
    &cType,                                 ///< ДИСПЛЕЙ - Сетка
    &cRefreshFPS,                           ///< ДИСПЛЕЙ - Частота обновл
    //PageDisplay::PageGrid::self,         ///< ДИСПЛЕЙ - СЕТКА
    &cScaleYtype,                           ///< ДИСПЛЕЙ - Смещение
    PageDisplay::PageSettings::self,     ///< ДИСПЛЕЙ - НАСТРОЙКИ
//    &cThickness,                            ///< ДИСПЛЕЙ - Толщина
    Page::Name::Display, 0, 0, 0, 0, 0
)
