#pragma once
#include "Osci/Osci_Settings.h"


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
namespace FPGA
{
    namespace Settings
    {
        /// Включить/выключить калибратор.
        void LoadCalibratorMode();

        /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        /// Режим канала по входу.
        struct ModeCouple
        {
            enum E
            {
                DC,      ///< Закрытый вход
                AC,      ///< Открытый вход
                GND,     ///< Вход заземлён.
                Size
            } value;
            explicit ModeCouple(E v) : value(v) {};
            pString UGO() const;

            static void Set(Chan::E ch, ModeCouple::E couple);
        };

        /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        struct Bandwidth
        {
            enum E
            {
                Full,     ///< Если это значение выбрано в меню КАНАЛ, то при этом положение устанавливается полоса из ОТЛАДКА-КАНАЛЫ-Полоса.
                _20MHz,
            } value;
        
            explicit Bandwidth(E v) : value(v) {};
            void Load();
        
        private:
            /// Возвращает канал, для которого является действующей эта настройка
            Chan::E GetChannel() const;
        };
    }
}
