#pragma once
#include "Settings/SettingsChannel.h"


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///  ласс отвечает за вывод информации в нижних двух строках экрана
namespace Osci
{
    namespace Display
    {
        namespace HiPart
        {
            void Draw();
            /// «аписывает главные параметры в указанную позицию. ¬озвращает х-координату правого верхнего угла выведенного изображени€
            int DrawMainParameters(int x, int y);
        };
    };
};
