#include "defines.h"
#include "BufferButtons.h"


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
enum
{
    SIZE = 100
};

/// Здесь хранятся все события
static KeyEvent buffer[SIZE];
/// Позиция первого свободного места в буфере. Когда end == 0, буфер пустой
static int end;
/// Позиция первого значащего события в буфере.
static int start;



/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void BufferButtons::Push(KeyEvent str)
{
    if(end == SIZE)
    {
        LOG_ERROR("Буфер переполнен");
        return;
    }

    buffer[end] = str;
    end++;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
KeyEvent BufferButtons::Extract()
{
    KeyEvent result = buffer[start];

    start++;
    if(start == end)
    {
        start = end = 0;
    }

    return result;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
bool BufferButtons::IsEmpty()
{
    return end == 0;
}

