#include "defines.h"
#include "Menu/MenuItems.h"
#include "Settings/SettingsTime.h"
#include "Osci/Measurements/Measures.h"
#include "Settings/Settings.h"
#include "Menu/Pages/Include/PageMeasures.h"


extern const Page pageAuto;

const Page * const PageMeasuresAuto::self = (const Page *)&pageAuto;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_CHOICE_2( cIsShow,                                                                                                                             //--- ИЗМЕРЕНИЯ - АВТОМАТ - Показывать ---
    "Показывать",
    "Выводить или не выводить измерения на экран",
    "Нет",
    "Да",
    SHOW_MEASURES, &PageMeasuresAuto::self, E_BtV, E_VB, E_VII
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static bool IsActive_NumberChannels()
{
    return SHOW_MEASURES;
}

DEF_CHOICE_7( cNumber,                                                                                                                             //--- ИЗМЕРЕНИЯ - АВТОМАТ - Количество ---
    "Количество"
    ,
    "Устанавливает максимальное количество выводимых измерений:\n"
    "\"1\" - одно измерение\n"
    "\"2\" - два измерения\n"
    "\"1х5\" - 1 строка с пятью измерениями\n"
    "\"2х5\" - 2 строки с пятью измерениями в каждой\n"
    "\"3х5\" - 3 строки с пятью измерениями в каждой\n"
    "\"6x1\" - 6 строк по одному измерению в каждой\n"
    "\"6х2\" - 6 строк по два измерения в каждой"
    ,
    "1",
    "2",
    "1x5",
    "2x5",
    "3x5",
    "6x1",
    "6x2",
    NUM_MEASURES, &PageMeasuresAuto::self, IsActive_NumberChannels, E_VB, E_VII
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_3(       cChannels,                                                                                  //--- ИЗМЕРЕНИЯ - АВТОМАТ - Каналы ---
    "Каналы",
    "По каким каналам выводить измерения",
    "1",
    "2",
    "1 и 2",
    SOURCE_MEASURES, &PageMeasuresAuto::self, IsActive_NumberChannels, E_VB, E_VII
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_PAGE_4( pageAuto, // -V641 // -V1027                                                                                                                           //--- ИЗМЕРЕНИЯ - АВТО ---
    "АВТОМАТ",
    "Доступ к настройкам автоматических измерений",
    &cIsShow,                                   ///< ИЗМЕРЕНИЯ - АВТОМАТ - Показывать
    &cNumber,                                   ///< ИЗМЕРЕНИЯ - АВТОМАТ - Количество
    &cChannels,                                 ///< ИЗМЕРЕНИЯ - АВТОМАТ - Каналы
    PageMeasuresAuto::PageTune::self,  ///< ИЗМЕРЕНИЯ - АВТОМАТ - НАСТРОИТЬ
    //&cMode,                                   ///< ИЗМЕРЕНИЯ - АВТОМАТ - Вид
    PageName::Measures_Auto, &PageMeasures::self, E_BtV, E_VB, E_VV, E_BfKE
)


//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/*
static bool IsActive_Mode()
{
    return SHOW_MEASURES;
}

DEF_CHOICE_2( cMode,                                                                                                                                      //--- ИЗМЕРЕНИЯ - АВТОМАТ - Вид ---
    "Вид", "View",
    "Уменьшать или нет зону вывода сигнала для исключения перекрытия его результами измерений",
    "Decrease or no zone output signal to avoid overlapping of its measurement results",
    "Как есть",  "As is",
    "Уменьшать", "Reduce",
    MODE_VIEW_SIGNALS, pageAuto, IsActive_Mode, 0, FuncDraw
)
*/
