#pragma once


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
class Console
{
public:
    static void Draw();

    static void AddString(char *string);

    static int NumberOfLines();

private:
    /// true означает, что идёт процесс вывода консоли и добавлять в неё новые строки нельзя (это происходит, когда добавление идёт из прерывания)
    static bool inProcessDrawConsole;
    /// Количество заполненных строк в консоли
    static int stringInConsole;
};

