#pragma once


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
namespace Console
{
    void Draw();

    void AddString(char *string);

    int NumberOfLines();
    /// Возвращает true, если консоль должна отображаться на экране
    bool IsShown();
    /// Эту фнукцию надо вызвыть, когда пользователь изменяет максимальное количество строк в консоли
    void OnChangedMaxStringsInConsole();
};

