#include "stdafx.h"
#ifndef WIN32
#include "defines.h"
#include "Keyboard.h"
#endif


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Key Keyboard::WaitPressingButton()
{
    return Key::None;
}

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Keyboard::Enable()
{
}

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Keyboard::Disable()
{
}

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
pString Key::Name()
{
    static const pString names[Key::Number] =
    {
        "None",
        "Функция",
        "Измер",
        "Память",
        "Сервис",
        "Канал 1",
        "Канал 2",
        "Развертка",
        "Пуск/стоп",
        "Синхр",
        "Дисплей",
        "Range 1 больше",
        "Range 1 меньше",
        "RShift 1 больше",
        "RShift 1 меньше",
        "Range 2 больше",
        "Range 2 меньше",
        "RShift 2 больше",
        "RShift 2 меньше",
        "TBase больше",
        "TBase меньше",
        "TShift больше",
        "TShift меньше",
        "Синхр больше",
        "Синхр меньше",
        "Влево",
        "Вправо",
        "Вверх",
        "Вниз",
        "Ввод",
        "1",
        "2",
        "3",
        "4",
        "5"
    };

    return names[value];
}

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
pString TypePress::ToString()
{
    static const pString names[4] =
    {
        "Вниз",
        "Повтор",
        "Вверх",
        "Пусто"
    };

    return names[value];
}
