#pragma once


namespace Osci
{
    namespace Measurements
    {
        /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        namespace Table
        {
            /// ќтрисовать результаты автоматических измерений
            void Draw();

            int NumCols();

            int NumRows();
            /// Ќа сколько сжимать сетку по горизонтали
            int GetDeltaGridLeft();
            /// ¬озвращает высоту пол€ дл€ вывода автоматического измерени€
            int DY();
            /// ¬озвращает ширину пол€ дл€ вывода автоматического измерени€
            int DX();
        };
    }
}
