#pragma once


namespace Osci
{
    namespace Measurements
    {
        namespace Settings
        {
            //-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
            /// Сжимать ли сигналы при выводе измерений.
            struct ModeViewSignals
            {
                enum E
                {
                    AsIs,       ///< Показывать сигналы как есть.
                    Compress    ///< Сжимать сетку с сигналами.
                } value;
                explicit ModeViewSignals(E v) : value(v) {};
            };
    
            //-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
            struct Source
            {
                enum E
                {
                    A,
                    B,
                    A_B
                } value;
                explicit Source(E v) : value(v) {};
            };
    
            //-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
            struct OnDisplay
            {
                enum E
                {
                    _1,      ///< 1 измерение слева внизу.
                    _2,      ///< 2 измерения слева внизу.
                    _1_5,    ///< 1 строка с 5 измерениями.
                    _2_5,    ///< 2 строки по 5 измерений.
                    _3_5,    ///< 3 строки по 5 измерений.
                    _6_1,    ///< 6 строк по 1 измерению.
                    _6_2     ///< 6 строк по 2 измерения.
                } value;
                explicit OnDisplay(E v) : value(v) {};
            };
        }
    }
}
