#pragma once


namespace Osci
{
    namespace Measurements
    {
        /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        namespace Table
        {
            /// ќтрисовать результаты автоматических измерений
            void Draw();

            int NumCols();

            int NumRows();
            /// Ќа сколько сжимать сетку по горизонтали
            int GetDeltaGridLeft();
            /// ¬озвращает высоту пол€ дл€ вывода автоматического измерени€
            int DY();
            /// ¬озвращает ширину пол€ дл€ вывода автоматического измерени€
            int DX();


            /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            class Cell
            {
            public:
                Cell(int _row, int _col) : row(_row), col(_col) {};
                void Draw(int x, int y);

            private:
                void DrawStringMeasure(int x, int y);

                int row;
                int col;
            };
        };
    }
}
