/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*! \page page1 Межпроцессорные коммуникации

    \tableofcontents

    \section section1 Межплатный шлейф

    \code
    +----+-------+--------------+----+----------------+-------------+----+----------------------------------------------------------------------------------------+
    | №  | Наим. |    437ZIT         |                |   429VIT6        |                                                                                        |
    |конт|       |     FPGA          |                |   Панель         |                                                                                        |
    +----+-------+--------------+----+----------------+-------------+----+----------------------------------------------------------------------------------------+
    |    |       | 43  PA7      | I  | MODE_PANEL     | 8  PC14     | O  | Режим работы панели : "0" - передача, "1" - приём.                                     |
    |    |       | 44  PC4      | O  | MODE_CONFIRM   | 9  PC15     | I  | "0" - подтверждение устройством состояния MODE_PANEL.                                  |
    |    |       | 127 PG12 NE4 | IO | BYTE_SET       | 7  PC13     | IO |                                                                                        |
    |    |       |              |    |                |             |    |                                                                                        |
    |    |       | 119 PD5  NWE | IO | BYTE_CONFIRM   | 86 PD5  NWE | IO |                                                                                        |
    |    |       | 118 PD4  NOE |    |                | 85 PD4  NOW |    |                                                                                        |
    |    |       |              |    |                |             |    |                                                                                        |
    |    | AD0   | 85  PD14 D0  | IO | D0             | 97 PE0  DA0 | IO |                                                                                        |
    |    | AD1   | 86  PD15 D1  | IO | D1             | 98 PE1  DA1 | IO |                                                                                        |
    |    | AD2   | 114 PD0  D2  | IO | D2             | 1  PE2  DA2 | IO |                                                                                        |
    |    | AD3   | 115 PD1  D3  | IO | D3             | 2  PE3  DA3 | IO |                                                                                        |
    |    | AD4   | 58  PE7  D4  | IO | D4             | 3  PE4  DA4 | IO |                                                                                        |
    |    | AD5   | 59  PE8  D5  | IO | D5             | 4  PE5  DA5 | IO |                                                                                        |
    |    | AD6   | 60  PE9  D6  | IO | D6             | 5  PE6  DA6 | IO |                                                                                        |
    |    | AD7   | 63  PE10 D7  | IO | D7             | 38 PE7  DA7 | IO |                                                                                        |
    +----+-------+--------------+----+----------------+-------------+----+----------------------------------------------------------------------------------------+
    \endcode

    \section section2 Обмен данными
    
        Устройство находится в режиме "FPGA -> Панель", когда MODE_PANEL == MODE_CONFIRM == "1".
        Устройство находится в режиме "Панель -> FPGA", когда MODE_PANEL == MODE_CONFIRM == "0".
        
        D0...D7,  в режиме "Панель -> FPGA" находятся в режиме выхода. Во всех остальных случаях - в высокоимпедансном режиме выхода.
       
        \subsection subsec1 Приём/передача на стороне устройства.

            *** Передача данных устройством ***
        
            1. Прочитать MODE_PANEL:
                - "0" - принять информацию.
            2. Настроить режимы пинов.
            3. Установить "1" на BYTE_SET.
            4. Установить "1" на MODE_CONFIRM - переходим в режим передачи.
            5. Выставить байт на D0...D7.
            6. Установить BYTE_SET в "0".
            7. Дождаться BYTE_CONFIRM == "1".
            8. Установить BYTE_SET в "1".
            9. Если есть ещё данные для передачи - переход к п.5.
            10. Установить "0" на MODE_CONFIRM - выход из режима передачи.
        
            *** Приём данных устройством ***
        
        
        
        \subsection subsec2 Приём/передача на стороне панели.
        
            *** Передача данных панелью ***
            
            
            *** Приём данных устройством ***
            
            1. Прочитать MODE_CONFIRM:
                - "
        
        \subsection subsec3 Установка режимов выходов.
        
        +----------------+--------------------+
        | 437ZIT FPGA    |        Режим       |
        +----------------+----------+---------+
        | Сигнал         | Передача |  Приём  |
        +----------------+----------+---------+
        | MODE_PANEL     |    I     |    I    |
        | MODE_CONFIRM   |    O     |    O    |
        | BYTE_SET       |    O     |    I    |
        | BYTE_CONFIRM   |    I     |    O    |
        +----------------+----------+---------+
        
        +----------------+--------------------+
        | 429VIT6 Панель |        Режим       |
        +----------------+----------+---------+
        | Сигнал         | Передача |  Приём  |
        +----------------+----------+---------+
        | MODE_PANEL     |    O     |    O    |
        | MODE_CONFIRM   |    I     |    I    |
        | BYTE_SET       |    O     |    I    |
        | BYTE_CONFIRM   |    I     |    O    |
        +----------------+----------+---------+

    \section section3 Работа с тестер-компонентом

    \code
    +----+----------+------+-----+--------------------------------------------------------+
    | №  |          |      |     |                                                        |
    |конт|          |      |     |                                                        |
    +----+----------+------+-----+--------------------------------------------------------+
    | 41 | DAC_TEST | PA5  | ЦАП | Сюда подаём напряжение в соотвествии с выбранным шагом |
    | 53 | TEST_ON  | PF13 | OUT | Включение тестер-компонента. Активный уровень - 0      |
    | 54 | PNP      | PF14 | OUT | Отрицательная полярность - 1, положительная - 0        |
    | 55 | U        | PF15 | OUT | 1 - управление напряжением, 0 - управление током       |
    | 56 | I        | PG0  | OUT | 1 - управление током, 0 - управление напряжением       |
    | 99 | TEST_STR | PC9  | IN  | Тактовые имульсы                                       |
    +----+----------+------+-----+--------------------------------------------------------+
    \endcode
*/
