#include "defines.h"
#include "Communication.h"


namespace Transceiver
{
    /// Функция инициализации пинов для режима передачи
    void(*InitPins)() = nullptr;
    /// Функция устновки в 1 REQ_SEND
    void(*Set_REQ_SEND)() = nullptr;
    /// Функция установки в 0 REQ_SEND
    void(*Reset_REQ_SEND)() = nullptr;
    /// Чтение пина разрешения передачи

    void SendByte(uint8 data);
    /// Дождаться разрешения на передачу
    void WaitPermit();
}


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Transceiver::SetCallbackInitPins(void(*func)())
{
    InitPins = func;

    Set_REQ_SEND();
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Send(uint8 *data, uint size)
{
    InitPins();

    Reset_REQ_SEND();

    for (uint i = 0; i < size; i++)
    {
        SendByte(data[i]);
    }
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::SendByte(uint8 /*data*/)
{

}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::WaitPermit()
{

}
