#include "defines.h"
#include "Transceiver.h"


namespace Transceiver
{
    namespace Transmitter
    {
        void Init(Mode mode);
        /// Инициализация пинов для режима передачи.
        void(*InitPinsSend)();

        namespace Device
        {
            void InitPinsSend();
        }

        namespace Panel
        {
            void InitPinsSend();
        }
    }

    namespace Receiver
    {
        void Init(Mode mode);
        /// Инициализация пинов для режима приёма.
        void(*InitPinsRecieve)();

        namespace Device
        {
            void InitPinsReceive();
        }

        namespace Panel
        {
            void InitPinsReceive();
        }
    }
}


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Transceiver::Init(Mode mode)
{
    Transmitter::Init(mode);
    Receiver::Init(mode);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Transmitter::Init(Transceiver::Mode mode)
{
    if (mode == Transceiver::Device)
    {
        InitPinsSend = Device::InitPinsSend;
    }
    else
    {
        InitPinsSend = Panel::InitPinsSend;
    }
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Receiver::Init(Mode mode)
{
    if (mode == Transceiver::Device)
    {
        InitPinsRecieve = Device::InitPinsReceive;
    }
    else
    {
        InitPinsRecieve = Panel::InitPinsReceive;
    }
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Transmitter::Send(uint8 byte)
{
    Send(&byte, 1);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Transmitter::Send(uint8 byte0, uint8 byte1)
{
    uint8 data[2] = { byte0, byte1 };
    Send(data, 2);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Transmitter::Send(uint8 * /*data*/, uint /*size*/)
{

}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Receiver::Update()
{
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
bool Transceiver::InInteraction()
{
    return true;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Transmitter::Device::InitPinsSend()
{

}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Transmitter::Panel::InitPinsSend()
{

}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Receiver::Panel::InitPinsReceive()
{

}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Transceiver::Receiver::Device::InitPinsReceive()
{

}
