#pragma once

/*
    Функциональность взаимодействия между процессорами
*/


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
namespace Transceiver
{
    /// Параметром передаётся указатель на функцию, которая будет вызываться при инициализации пинов на приём или передачу, чтобы внешняя программа знала, что нужно перенастроить выводы,
    /// если мы хотим использовать их в другом режиме.
    void Init();

    bool InInteraction();

    /// Функция циклического опроса. Принимает данные, если таковые имеются, и передаёт их через функцию, установленную в SetCallbackReceive.
    bool Update();

    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    namespace Transmitter
    {
        void Send(const uint8 *data, uint size);
        void Send(uint8 data);
        void Send(uint8 byte0, uint8 byte1);
    };
};

