#include "defines.h"
#include "FPGA/FPGA_Settings.h"
#include "Menu/Pages/Include/PageTrig.h"
#include "Settings/Settings.h"


using namespace Osci::Settings;


//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cMode,                                                                                                                                          //--- СИНХР - ПОИСК - Режим ---
    "Режм",
    "Выбор режима автоматического поиска синхронизации:\n"
    "1. \"Ручной\" - поиск производится по нажатию кнопки \"Найти\" или по удержанию в течение 0.5с кнопки СИНХР, если установлено "
    "\"СЕРВИС\x99Реж длит СИНХР\x99Автоуровень\".\n"
    "2. \"Автоматический\" - поиск производится автоматически.",
    "Ручной",
    "Автоматический",
    TRIG_MODE_FIND,
    &PageTrig::PageFind::self, Item::EmptyActive, E_VB, E_VII
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_Search()
{
    Osci::Settings::Trig::Level::Find();
}

DEF_BUTTON( bSearch,                                                                                                                                          //--- СИНХР - ПОИСК - Найти ---
    "Найти",
    "Производит поиск уровня синхронизации.",
    &PageTrig::PageFind::self, Item::EmptyActive, OnPress_Search
)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_PAGE_2( pFind, // -V641 // -V1027                                                                                                                                 //--- СИНХР - ПОИСК ---
    "ПОИСК",
    "Управление автоматическим поиском уровня синхронизации.",
    &cMode,                         ///< СИНХР - ПОИСК - Режим
    &bSearch,                       ///< СИНХР - ПОИСК - Найти
    PageName::Trig_Search,
    &PageTrig::self, Item::EmptyActive, E_VB, Page::EmptyBeforeDraw, E_BfKE
)

const Page * const PageTrig::PageFind::self = (const Page *)&pFind;
