#include "defines.h"
#include "FPGA/FPGA_Settings.h"
#include "Menu/Pages/Include/PageTrig.h"
#include "Settings/Settings.h"


using namespace Osci::Settings;

extern const PageBase pageFind;

const Page * const PageTrig::PageFind::self = (const Page *)&pageFind;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static const char *hintsSearch_Mode[] = { "Ручной", "Hand", "Автоматический",  "Auto" };

static const ChoiceBase cMode =                                                                                                                               //--- СИНХР - ПОИСК - Режим ---
{
    Control::Type::Choice, 2, false, Page::Name::NoPage, &PageTrig::PageFind::self, 0,
    {
        "Режим"
        ,
        "Выбор режима автоматического поиска синхронизации:\n"
        "1. \"Ручной\" - поиск производится по нажатию кнопки \"Найти\" или по удержанию в течение 0.5с кнопки СИНХР, если установлено "
        "\"СЕРВИС\x99Реж длит СИНХР\x99Автоуровень\".\n"
        "2. \"Автоматический\" - поиск производится автоматически."
    },
    (int8 *)&TRIG_MODE_FIND, // -V206
    hintsSearch_Mode, 0, 0
};

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_Search()
{
    Osci::Settings::Trig::Level::Find();
}

DEF_BUTTON( bSearch,                                                                                                                                          //--- СИНХР - ПОИСК - Найти ---
    "Найти",
    "Производит поиск уровня синхронизации.",
    &PageTrig::PageFind::self, 0, OnPress_Search, 0
)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_PAGE_2( pageFind, // -V641 // -V1027                                                                                                                              //--- СИНХР - ПОИСК ---
    "ПОИСК",
    "Управление автоматическим поиском уровня синхронизации.",
    &cMode,                         ///< СИНХР - ПОИСК - Режим
    &bSearch,                       ///< СИНХР - ПОИСК - Найти
    Page::Name::Trig_Search,
    &PageTrig::self, 0, 0, 0, 0
)
