#pragma once
#include "Menu/MenuItems.h"


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
class PageFunction
{
public:
    static const PageBase *pointer;

    //------------------------------------------------------------------------------------------------------------------------------------------------
    class PageFrequencyCounter
    {
    public:
        static const PageBase *pointer;

        /// \todo Здесь страшенный говнокод. Нельзя опускаться до персональных проверок

    /// Возвращает указатель на ИЗМЕРЕНИЯ - ЧАСТОТОМЕР - Время счёта F
        static const Choice *GetChoiceTimeF();
        /// Возвращает указаетль на ИЗМЕРЕНИЯ - ЧАСТОТОМЕР - Метки времени
        static const Choice *GetChoiceFreqClc();
        /// Возвращает указатель на ИЗМЕРЕНИЯ - ЧАСТОТОМЕР - Кол-во периодов
        static const Choice *GetChoiceNumPeriods();
    };

    //------------------------------------------------------------------------------------------------------------------------------------------------
    class PageFFT
    {
    public:
        static const PageBase *pointer;
    };

    //------------------------------------------------------------------------------------------------------------------------------------------------
    class PageMultimeter
    {
    public:
        static void Init();

        static void OnChanged_Mode(bool);

        static const PageBase *pointer;
    };

    //------------------------------------------------------------------------------------------------------------------------------------------------
    class PageTester
    {
    public:

        static void Init();

        static void OnChanged_Control(bool);

        static const PageBase *pointer;
    };

    //------------------------------------------------------------------------------------------------------------------------------------------------
    class PageRecorder
    {
    public:
        static const PageBase *pointer;

        //--------------------------------------------------------------------------------------------------------------------------------------------
        class PageSource
        {
        public:
            
            static const PageBase *pointer;
        };

        //--------------------------------------------------------------------------------------------------------------------------------------------
        class PageRecord
        {
        public:
            static const PageBase *pointer;
        };

        //--------------------------------------------------------------------------------------------------------------------------------------------
        class PagePlay
        {
        public:
            static const PageBase *pointer;
        };
    };
};
