#include "defines.h"
#include "Menu/Pages/Include/PageFunction.h"
#include "Settings/Settings.h"


extern const PageBase pageSource;

const Page * const PageFunction::PageRecorder::PageSource::self = (const Page * const)&pageSource;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_CHOICE_2( cChanA,                                                                                                                    //--- ФУНКЦИЯ - РЕГИСТРАТОР - ИСТОЧНИК - Канал 1 ---
    "Канал 1",
    "Выбор канала 1 для записи и просмотра",
    DISABLE_RU,
    ENABLE_RU,
    RECORDER_SOURCE_A, PageFunction::PageRecorder::PageSource::self, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cChanB,                                                                                                                    //--- ФУНКЦИЯ - РЕГИСТРАТОР - ИСТОЧИНК - Канал 2 ---
    "Канал 2",
    "Выбор канала 2 для записи и просмотра",
    DISABLE_RU,
    ENABLE_RU,
    RECORDER_SOURCE_B, PageFunction::PageRecorder::PageSource::self, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cSensor,                                                                                                                    //--- ФУНКЦИЯ - РЕГИСТРАТОР - ИСТОЧИНК - Датчик ---
    "Датчик",
    "Выбор датчика для записи и просмотра",
    DISABLE_RU,
    ENABLE_RU,
    RECORDER_SOURCE_SENSOR, PageFunction::PageRecorder::PageSource::self, 0, 0, 0
)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_PAGE_2( pageSource, // -V641 // -V1027                                                                                                         //--- ФУНКЦИЯ - РЕГИСТРАТОР - ИСТОЧНИК ---
    "ИСТОЧНИК",
    "Выбор записываемых сигналов",
    &cChanA,        ///< ФУНКЦИЯ - РЕГИСТРАТОР - ИСТОЧНИК - Канал 1
    &cChanB,        ///< ФУНКЦИЯ - РЕГИСТРАТОР - ИСТОЧИНК - Канал 2
    //&cSensor,       ///< ФУНКЦИЯ - РЕГИСТРАТОР - ИСТОЧНИК - Датчик
    Page::Name::Function_Recorder_Source, PageFunction::PageRecorder::self, 0, 0, 0, 0
)
