#include "defines.h"
#include "Menu/MenuItems.h"
#include "Menu/Pages/Include/PageFunction.h"
#include "Recorder/Recorder.h"
#include "Settings/Settings.h"


extern const Page pageView;

const Page * const PageRecorder::PageShow::PageView::self = (const Page *)&pageView;



/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_CHOICE_2( cMove,                                                                                                      //--- тсмйжхъ - пецхярпюрнп - опнялнрп - опнялнрп - оЕПЕЛЕЫЕМХЕ ---
    "оЕПЕЛЕЫЕМХЕ",
    "",
    "X",
    "Y",
    RECORDER_AXIS_MOVE, &PageRecorder::PageShow::PageView::self, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2( cZoom,                                                                                                          //--- тсмйжхъ - пецхярпюрнп - опнялнрп - опнялнрп - лЮЯЬРЮА ---
    "лЮЯЬРЮА",
    "",
    "X",
    "Y",
    RECORDER_AXIS_ZOOM, &PageRecorder::PageShow::PageView::self, 0, 0, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_Less()
{

}

DEF_BUTTON( bLess,                                                                                                             //--- тсмйжхъ - пецхярпюрнп - опнялнрп - опнялнрп - лЕМЭЬЕ ---
    "лЕМЭЬЕ",
    "",
    &PageRecorder::PageShow::PageView::self, 0, OnPress_Less, 0
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_More()
{

}

DEF_BUTTON( bMore,                                                                                                             //--- тсмйжхъ - пецхярпюрнп - опнялнрп - опнялнрп - аНКЭЬЕ ---
    "аНКЭЬЕ",
    "",
    &PageRecorder::PageShow::PageView::self, 0, OnPress_More, 0
)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_PAGE_5( pageView, // -V641 // -V1027                                                                                                //--- тсмйжхъ - пецхярпюрнп - опнялнрп - опнялнрп ---
    "опнялнрп",
    "",
    &cMove,                                                                 ///< тсмйжхъ - пецхярпюрнп - опнялнрп - опнялнрп - оЕПЕЛЕЫЕМХЕ
    &cZoom,                                                                 ///< тсмйжхъ - пецхярпюрнп - опнялнрп - опнялнрп - лЮЯЬРЮА
    &bLess,                                                                 ///< тсмйжхъ - пецхярпюрнп - опнялнрп - опнялнрп - лЕМЭЬЕ
    &bMore,                                                                 ///< тсмйжхъ - пецхярпюрнп - опнялнрп - опнялнрп - аНКЭЬЕ
    PageRecorder::PageShow::PageView::PageCursors::self,      ///< тсмйжхъ - пецхярпюрнп - опнялнрп - опнялнрп - йспянпш
    PageName::Function_Recorder_Show_View, &PageRecorder::PageShow::self, 0, 0, 0, 0
)
