#include "defines.h"
#include "Menu/MenuItems.h"
#include "Menu/Pages/Include/PageRecorder.h"


//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_Rename()
{

}

DEF_BUTTON( bRename,                                                                                                    //--- ФУНКЦИЯ - РЕГИСТРАТОР - ПРОСМОТР - ОПЕРАЦИИ - Переименовать ---
    "Переименовать",
    "",
    &PageRecorder::PageShow::PageOperations::self, Item::Active, OnPress_Rename
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_Copy()
{

}

DEF_BUTTON( bCopy,                                                                                                         //--- ФУНКЦИЯ - РЕГИСТРАТОР - ПРОСМОТР - ОПЕРАЦИИ - Копировать ---
    "Копировать",
    "",
    &PageRecorder::PageShow::PageOperations::self, Item::Active, OnPress_Copy
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_Move()
{

}

DEF_BUTTON( bMove,                                                                                                        //--- ФУНКЦИЯ - РЕГИСТРАТОР - ПРОСМОТР - ОПЕРАЦИИ - Переместить ---
    "Переместить",
    "",
    &PageRecorder::PageShow::PageOperations::self, Item::Active, OnPress_Move
)

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_Delete()
{

}

DEF_BUTTON( bDelete,                                                                                                          //--- ФУНКЦИЯ - РЕГИСТРАТОР - ПРОСМОТР - ОПЕРАЦИИ - Удалить ---
    "Удалить",
    "",
    &PageRecorder::PageShow::PageOperations::self, Item::Active, OnPress_Delete
)

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_PAGE_4( pOperations, // -V641 // -V1027                                                                                             //--- ФУНКЦИЯ - РЕГИСТРАТОР - ПРОСМОТР - ОПЕРАЦИИ ---
    "ОПЕРАЦИИ",
    "",
    &bRename,   ///< ФУНКЦИЯ - РЕГИСТРАТОР - ПРОСМОТР - ОПЕРАЦИИ - Переименовать
    &bCopy,     ///< ФУНКЦИЯ - РЕГИСТРАТОР - ПРОСМОТР - ОПЕРАЦИИ - Копировать
    &bMove,     ///< ФУНКЦИЯ - РЕГИСТРАТОР - ПРОСМОТР - ОПЕРАЦИИ - Переместить
    &bDelete,   ///< ФУНКЦИЯ - РЕГИСТРАТОР - ПРОСМОТР - ОПЕРАЦИИ - Удалить
    PageName::Function_Recorder_Show_Operations, &PageRecorder::PageShow::self, Item::Active, Page::Changed, Page::BeforeDraw, E_BfKE
)

const Page * const PageRecorder::PageShow::PageOperations::self = (const Page *)&pOperations;
