#pragma once


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
class FSMC
{
public:
    static void Init();

    static uint8 ReadByte();
    /// Передать буфер по шине. Если параметры равны нулю, передаётся ранеее не переданный из-за того, что шёл процесс приём
    static void WriteBuffer(uint8 *data = 0, int length = 0);

private:
    /// Шина переходит в режим чтения данных
    static void ConfigToRead();
    /// Шина переходит в режим передачи данных
    static void ConfigToWrite();
    /// Возвращает true, если сигнал RD FPGA находится в высоком состоянии
    static bool inReadState;
};
