#pragma once


namespace Osci
{
    namespace Measurements
    {
        /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        namespace Graphics
        {
            /// Отрисовать результаты автоматических измерений
            void Draw();

            int NumCols();

            int NumRows();
            /// На сколько сжимать сетку по горизонтали
            int GetDeltaGridLeft();
            /// На сколько сжимать сетку по вертикали
            static int GetDeltaGridBottom();
            /// Возвращает высоту поля для вывода автоматического измерения
            static int DY();
            /// Возвращает ширину поля для вывода автоматического измерения
            static int DX();
        };
    }
}
